import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-student',
  templateUrl: './student.component.html',
  styleUrls: ['./student.component.scss']
})
export class StudentComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
  }

  specializations = [
    {
      image: 'https://amezdwnzfp.cloudimg.io/v7/https://firebasestorage.googleapis.com/v0/b/ipz-site.appspot.com/o/images%2Fspec%2F1.png?alt=media&token=ec05ea6d-8dd3-4364-a2e7-bcbb412d63d9',
      title: 'Програмно-інформаційні системи',
      subtitle: 'Вибірковий блок 1',
      knowledge: [
        "основ алгоритмізації й програмування;",
        "об’єктно-орієнтованого й функціонального програмування;",
        "технологій розроблення програмного забезпечення;",
        "проектування програмного забезпечення;",
        "програмування операційних систем і системного програмування;",
        "кросплатформеного програмування;",
        "веб програмування;",
        "проектування й програмування баз даних;",
        "управління ІТ проектами й командами розробників."
      ],
      allow: [
        "розробляти будь-які додатки для комп’ютерів, серверів, мобільних пристроїв;"
      ],
      know: [
        "Математику",
        "Основи програмування",
        "Об’єктно-орієнтоване програмування",
        "Архітектуру ЕОМ"
      ],
      subjects: [
        "Комп’ютерна графіка та візуалізація",
        "Емпірична методи програмної інженерія",
        "Конструювання програмного забезпечення",
        "Основи розподілених обчислень та паралельного програмування",
        "Економіка IT компаній",
        "Менеджмент командної розробки програмного забезпечення",
        "Кросплатформене програмування",
        "Хмарні технології",
        "Програмування інтернет речей (IoT)"
      ]
    },
    {
      image: 'https://amezdwnzfp.cloudimg.io/v7/https://firebasestorage.googleapis.com/v0/b/ipz-site.appspot.com/o/images%2Fspec%2F2.png?alt=media&token=1d542dc0-53aa-4289-9e9d-6750aa3e94d1',
      title: 'Програмні системи даталогії',
      subtitle: 'Вибірковий блок 2',
      knowledge: [
        "основ алгоритмізації й програмування;",
        "методів збору й оброблення інформації;",
        "методів класифікації, прогнозування, кластерного аналізу, пошуку асоціативних правил;",
        "технологій створення моделей машинного навчання;",
        "технологій розроблення та проектування програмного забезпечення для систем інтелектуального аналізу даних;",
        "основних галузей практичного застосування даталогії."
      ],
      allow: [
        "використовувати отримані знання в будь-якій галузі;",
        "розробляти нові моделі машинного навчання;",
        "використовувати програмні засоби машинного навчання і аналізу даних в процесі розробки програмного забезпечення."
      ],
      know: [
        "Математику",
        "Основи програмування",
        "Об’єктно-орієнтоване програмування",
        "Англійську мову (дуже бажано)"
      ],
      subjects: [
        "Технології статистичного аналізу даних",
        "Збирання, зберігання та оброблення даних",
        "Алгоритмічні основи інтелектуальних систем",
        "Паралельне програмування",
        "Візуалізація даних",
        "Теорія і технологія блокчейн",
        "Програмні засоби машинного навчання і аналізу даних",
        "Математичні і програмні технології аналізу даних",
        "Маркетингова аналітика та аналіз даних"
      ]
    },
    {
      image: 'https://amezdwnzfp.cloudimg.io/v7/https://firebasestorage.googleapis.com/v0/b/ipz-site.appspot.com/o/images%2Fspec%2F3.png?alt=media&token=4db780d1-5c63-4dcc-ae37-37bddf2958ca',
      title: 'Програмування вбудованих і мобільних систем (ВМС)',
      subtitle: 'Вибірковий блок 3',
      knowledge: [
        "основ алгоритмізації й програмування;",
        "структурної й функціональної організації програмно-апаратних електронних систем і комплексів;",
        "функціонування цифрового (мікропроцесорного) обладнання;",
        "технологій розроблення програмного забезпечення мобільних електронних систем і Інтернет-Додатків;",
        "мов програмування вбудованих мікропроцесорних систем;",
        "архітектури мікроконтролерів і їх програмування для мобільних електронних систем і комплексів;",
        "програмування операційних систем і системного програмування; ",
        "методів прогнозування надійності апаратних і програмних засобів мобільних електронних систем;",
        "основні галузі практичного використання, історію та перспективи розвитку ВМС;",
        "особливості розробки кросплатформеного забезпечення ВМС;",
        "особливості апаратної реалізації, інтерфейси та периферійні пристрої, окремі аспекти сумісності виробів різних виробників при роботи в великих програмно-апаратних комплексах;",
        "особливості сучасних мікроконтролерів та сумісних з ними елементів, систем на чипі та можливості інтеграції вбудованих систем в великі комплекси, зокрема в межах інтернету речей."
      ],
      allow: [
        "створювати будь-які Smart додатки для IoT (інтернет речей) та для автономних систем автоматичного управління, побутових пристриїв, роботів; - програмувати й тестувати мікропроцесорну техніку й/або комп`ютери, що вбудовується в програмно-апаратні комплекси (системи) для розв’язання конкретних функціональних завдань (smart побутова техніка, роботи, беспілотні транспортні засоби, автоматизація виробництва тощо);",
        "програмувати й тестувати мобільне обладнання й системи;",
        "програмувати й тестувати програмне забезпечення вбудованих та мобільних систем;",
        "забезпечувати за допомогою програмних методів можливість мобільного застосування апаратно-програмних комплексів і систем при їхній експлуатації;",
        "проектувати мобільні додатки;",
        "використовувати CASE-системи для розробки вбудованих та мобільних систем;",
        "створювати script-розширення існуючих алгоритмічних мов для спрощення розробки та підтримки експлуатації програмного забезпечення вбудованих та мобільних систем."
      ],
      know: [
        "Математику;",
        "Основи програмування;",
        "Основи побудови комп’ютерів;",
        "Англійську мову (дуже бажано)."
      ],
      subjects: [
        "Програмування ВМС і ІоТ",
        "Операційні системи ВМС",
        "CASE - системи для програмування ВМС",
        "Системи автоматизованого проектування в галузі ВМС",
        "Схемотехніка ВМС (з елементами нізькорівневого програмування)",
        "Програмування взаємодії ВМС з зовнішними пристроями",
        "Спеціалізоване програмування ВМС та ІоТ",
        "Моделювання програмно-апаратних систем",
        "Алгоритми ідентифікації та розпізнавання в ІоТ"
      ]
    },
    {
      image: 'https://amezdwnzfp.cloudimg.io/v7/https://firebasestorage.googleapis.com/v0/b/ipz-site.appspot.com/o/images%2Fspec%2F4.png?alt=media&token=4f4ba992-a02b-4632-a7aa-24ba32c254c0',
      title: 'Програмування комп`ютерних ігор',
      subtitle: 'Вибірковий блок 4',
      knowledge: [
        "основ алгоритмізації й програмування;",
        "методів структурної й функціональної організації апаратно-програмних електронних систем і комплексів;",
        "функціонування цифрових і мікропроцесорних обладнань;",
        "технологій розроблення програмного забезпечення мобільних електронних систем і Інтернет-Додатків;",
        "мов програмування вбудованих мікропроцесорних систем;",
        "архітектури мікроконтролерів і їх програмування для мобільних електронних систем і комплексів;",
        "програмування операційних систем і системного програмування;",
        "методів прогнозування надійності апаратних і програмних засобів мобільних електронних систем."
      ],
      allow: [
        "створювати будь-які Smart додатки для IoT (інтернет речей);",
        "програмувати й тестувати мікропроцесорну техніку й/або комп`ютери, що вбудовується в апаратно-програмні комплекси (системи) для розв’язання конкретних функціональних завдань;",
        "програмувати й тестувати мобільне обладнання й системи;",
        "забезпечувати за допомогою програмних методів можливість мобільного застосування апаратно-програмних комплексів і систем при їхній експлуатації;",
        "проектувати мобільні додатки."
      ],
      know: [
        "Математику;",
        "Основи програмування;",
        "Архітектуру ЕОМ;",
        "Комп`ютерні мережі."
      ],
      subjects: [
        "Обчислювальна геометрія",
        "Математичні основи комп`ютерних ігор",
        "Комп’ютерне моделювання фізики природних явищ",
        "Комп`ютерна графіка",
        "Технології графічного дизайну",
        "Програмування штучного інтелекту ігор",
        "Програмування змішаної реальності",
        "Архітектура комп`ютерних ігор і систем віртуальної реальності",
        "Програмування багатокористувацьких ігор"
      ]
    },
    {
      image: 'https://amezdwnzfp.cloudimg.io/v7/https://firebasestorage.googleapis.com/v0/b/ipz-site.appspot.com/o/images%2Fspec%2F5.png?alt=media&token=38e18243-5b1c-4859-b2e5-9de64d0829b4',
      title: 'ERP програмування',
      subtitle: 'Вибірковий блок 5',
      knowledge: [
        "основ алгоритмізації й програмування;",
        "методів структурної й функціональної організації автоматизованих систем управління підприємством (Enterprise Resource Planning, ERP-систем);",
        "типової структури ERP-систем (управління фінансами. кадрами, кар’єрою, споживачами, ресурсами, логістикою, нерухомістю, бізнес-аналітикою);",
        "основних галузей застосування (банкі, підпріємства, комерція, виробництво, технологічні процеси, освіта, силові відомства, медицина, транспорт, спорт, сфера розваг тощо);",
        "функціонування та раціонального конфігурування апаратного базису ERP-систем;",
        "технологій розроблення програмного забезпечення, особливостей мов програмування та особливостей використання вбудованих налаштувань ERP-систем;",
        "архітектури мікроконтролерів і їх програмування для вбудованих та мобільних додатків ERP-систем;",
        "програмування операційних систем і системного програмування ERP-систем;",
        "методів прогнозування надійності апаратних і програмних засобів ERP-систем."
      ],
      allow: [
        "виконувати функції консультанта ERP-систем (програмування на вбудованих алгоритмічних мовах та раціональне виконання вбудованих налаштувань);",
        "проектувати структуру ERP-систем, виходячи з потреб замовника та існуючих ресурсних обмежень;",
        "адмініструвати ERP-системи на всіх рівнях (апаратний, програмно-системний та нормативний в частині керування ліцензіями та захисту інтересів фахівців програмного профілю);",
        "інтегрувати ERP-системи з існуючими автономними програмними системами;",
        "інтегрувати ERP-системи в програмно-апаратні комплекси сучасного управління технологічними процесами;",
        "проектувати, ставити завдання та програмувати задачі щодо бізнес-аналітики на базі ERP-систем;",
        "проектувати та реалізовувати інтерфейси користувачів ERP-систем у відповідності до постановки задачі;",
        "організовувати роботу, виконувати налаштування та розробляти необхідні додаткові програмні продукти щодо забезпеченн необхідног рівню інформаційної безпеки;",
        "организовувати та виконувати контроль якості ERP-систем, що розробляються;",
        "використовувати вбудовані системи управління проектом розробки ERP-систем, в тому числі CASE-системи."
      ],
      know: [
        "Математику;",
        "Основи програмування;",
        "Основи побудови комп’ютерів;",
        "Англійську мову (дуже бажано)."
      ],
      subjects: [
        "Основи ERP-систем",
        "Програмування ERP-систем",
        "Інтегрований проектний менеджмент ERP-систем",
        "Програмно-апаратний базис ERP-систем",
        "Інтеграція ERP систем та ІоТ",
        "Програмні технології Big Data в ERP - системах",
        "Економіка і маркетінг ERP- систем",
        "Бізнес-аналітика ERP- систем",
        "Розробка мультіплатформених рішень"
      ]
    }
  ];
  currentSpec = this.specializations[0];
  isShowModal = false;

  openModal(index) {
    this.currentSpec = this.specializations[index];
    this.isShowModal = true;
    var body = document.getElementsByTagName('body')[0];
    body.classList.add('openModal');
  }

  closeModal() {
    var body = document.getElementsByTagName('body')[0];
    body.classList.remove('openModal');
    this.isShowModal = false;
  }
}
